//___________________________________________________________________
//___________________________________________________________________
//  Copyright : 2015 BY HOLTEK SEMICONDUCTOR INC
//  File Name : Readme.h
// Description: user 自定義參數設定
//Targer Board:
//   MCU      : HT45F75/HT45F77
//   Author   : ChenTing
//   Date     : 2015/06/26
//___________________________________________________________________
//___________________________________________________________________
#ifndef _USERDEFINE_H_
#define _USERDEFINE_H_

//@@@@@@@@@@@@@@@@@@@@@@@@@@@ 系統基礎設定 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
// 支持 HT45F65,HT45F66,HT45F67
#define HT45F67
//  可選頻率有 4000000,8000000，12000000
//  可選時鐘來源有 HIRC,HXT
#define HIRC
#define SysFrequency	4000000













#endif
